Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Каждому порту можно задать тип, имя и метку, которая будет отображаться при наведении курсора на него.
en: It is possible to set a type, name and caption for each port. It will be displayed when hovering a cursor over it.

source: Каждому порту можно задать тип, имя и название, которое будет отображаться при наведении курсора на него.
en: It is possible to set a type, name and caption for each port. It will be displayed when hovering a cursor over it.

source: Каждому уникальному значению поля, кроме опорной категории, выделяется своя колонка, в которую записывается значение 1, а все остальные значения строки равны 0; опорная категория кодируется строкой из нулей.
en: A separate column is assigned to each unique field value, with the exception of the reference category. Value 1 is recorded in it, whereas all other string values are equal to 0. The reference category is encoded using the string that consists of zeros.

source: Каждый блок на своем уровне иерархии может быть представлен в виде «черного ящика», выполняющего независимую подзадачу.
en: Each block can be represented on its hierarchic level in the form of the "black box" performing its independent subtask.

source: Каждый выбранный вариант преобразования в результирующем наборе данных будет образовывать отдельный столбец.
en: Each selected option of transformation in the resulting data set will form a separate column.

source: Каждый метод веб-сервиса имеет определенный идентификатор и выполняет сопоставленное этому идентификатору действие.
en: Each web service method has a particular identifier and performs the action that matches this identifier.

source: Каждый новый процесс начинается со строки "Активация узлов", это обусловлено тем, что при старте работы Сценария параллельно могут выполняться сразу несколько узлов (см.
en: Each new process starts from the "Nodes activation" string. It is explained by the fact that several nodes at once can be run in parallel at the Workflow start (refer to

source: Каждый пакет содержит хотя бы один модуль.
en: Each package contains at least one module.

source: Как видно вторая переменная b была переименована в b_1, в то время как вторая переменная a0 была переименована в a1, и a1 была переименована в a2 так как после переименовки a0 в a1 уже она являлась дублем.
en: Obviously, the second variable b was renamed to b_1, whereas the second variable a0 was renamed to a1, and a1 was renamed to a2 because after renaming of a0 to a1, it had already been a double.

source: Как видно из примера, группа образуется уникальным сочетанием значений полей, выбранных в качестве группировочных.
en: The example shows that the group is formed by the unique combination of the fields values selected as the grouping ones.

source: Как видно из таблицы сравнения исходных данных с итоговыми, все значения не попавшие в Таблицу замен не заменяются, и выдаются в исходном виде.
en: As shown in the table of comparison of the source data with the final one, all data not included into the Replacement table is not replaced and it is shown in the source form.

source: Как видно из таблицы, ряд продаж для товара "Томатная паста" имеет очень большую положительную корреляцию, а товара "Макароны" — отрицательную.
en: As shown in the table, the sale series of the "Tomato paste" item of goods is distinguished by very high positive correlation, whereas the "Pasta" item of goods is characterized by the negative correlation.

source: Как для выбросов, так и для экстремальных значений доступны следующие методы редактирования:
en: The following elimination methods are available both for outliers and extreme values:

source: Как для регрессионных сетей, так и для классификатора это равная 0 среднеквадратическая ошибка на обучающем множестве.
en: It is the root-mean-square error of the training set equal to 0 both for regression networks, and for the classifier.

source: Как и в компоненте JavaScript поддерживаются внешние модули, но в Калькуляторе возможно использование только модульной системы CommonJS.
en: External modules are supported as in the JavaScript component but it is possible to use only CommonJS module systems in Calculator.

source: Как и поле Пользователь имеет возможность поиска через поле фильтра.
en: It is also possible to search by the filter field as in the User field.

source: Как правило, (но не обязательно) метод принимает входные данные и возвращает ответ.
en: As a rule, the method receives the input data and returns the response (but not necessarily).

source: Как правило, здесь происходит проверка того, что найденная запись является записью пользователя и является членом заданной группы.
en: As a rule, it is checked here that the detected record is the user record, and it is a member of the set group.

source: Как правило, они являются вложенными относительно основных компонентов подключенного Пакета и в их названии содержится префикс в виде двойного нижнего подчеркивания.
en: As a rule, they are nested relative to the main components of the connected Package, and prefix is included into their name in the form of the double underscore.

source: Как правило, содержит поля основного и присоединяемого наборов.
en: As a rule, it contains the fields of the main and joined data sets.

source: Как правило, этот параметр напрямую коррелирует от параметра нормализации входных данных.
en: As a rule, this parameter directly correlates with the normalization parameter of the input data.

source: Как только кнопка мыши будет отпущена, масштаб просмотра выделенной области будет увеличен.
en: As soon as the mouse button is released, it will be possible to zoom in the selected area view.

source: Как узнать версию Loginom
en: How to Define Loginom Version

source: Калининградская обл.
en: The Kaliningrad Region

source: Калькулятор JS
en: JS Calculator

source: Квантование применяется к данным с типами: целый, вещественный и дата/время (см.
en: Binning is used for the following data types: integer, real and date/time (refer to

source: Квота верхней границы
en: Upper bound quota

source: Квота интервала
en: Bin quota

source: Квота нижней границы
en: Lower bound quota

source: Кириллическая (1251);
en: Cyrillic (1251);

source: Классифицировано
en: Predicted

source: Кластер состоит из узлов сети.
en: The cluster consists of the network nodes.

source: Кластеризация.
en: Clustering.

source: Кластеры в столбцах:
en: Clusters in columns:

source: Кластеры в строках:
en: Clusters in rows:

source: Клиенты.
en: Clients.

source: Клиенты: 12c, 11g, 10g, 9i, 8i, 8.0
en: Clients: 12c, 11g, 10g, 9i, 8i, 8.0

source: Клиенты: 5.7, 5.6, 5.5, 5.1, 5.0, 4.1, 4.0 и 3.23
en: Clients: 5.7, 5.6, 5.5, 5.1, 5.0, 4.1, 4.0 and 3.23

source: Клик правой кнопкой мыши по элементу в файловом менеджере вызывает контекстное меню, в котором содержатся все вышеперечисленных функции кроме Загрузить и Создать каталог.
en: By clicking on the item in the file manager with the right mouse button, it is possible to call the context menu in which all functions listed above are available, with the exception of Load and Create directory.

source: Кнопка — возвращает цвет по умолчанию.
en: button: return the default color.

source: Кнопка Предпросмотр… позволяет оценить корректность запроса, отображая до 100 первых строк результирующей таблицы.
en: Preview… button enables to access request accuracy. It displays up to 100 first rows of the resulting table.

source: Кнопка Сгенерировать дочерние элементы Сгенерировать дочерние элементы раскрывает рекурсивный узел (добавляет все подузлы рекурсивного узла в дерево данных).
en: Generate child elements Generate child elements button opens the recursive node (it adds all subnodes of the recursive node to the data tree).

source: Кнопка Следующий рекурсивный нераскрытый узел Следующий рекурсивный нераскрытый узел выбирает текущим узлом следующий рекурсивный нераскрытый узел после текущего выбранного узла.
en: Next recursive unopened node Next recursive unopened node button enables to select the next recursive unopened node as the current node after the current selected node.

source: Кнопка вызывает диалог выбора файла.
en: button calls the file selection dialog.

source: Кнопка вызывает диалог выбора файла;
en: button calls the file selection dialog.

source: Кнопка Создать таблицу открывает окно создания новой таблицы в БД.
en: Create table button enables to open the window for the new table creation in DB.

source: Кнопка Активировать делает активным это подключение.
en: Activate button makes this connection active.

source: Кнопка панель закрывает.
en: button will close the panel.

source: Кнопка видна, только если все объекты не вмещаются в Адресную строку.
en: The button is visible only if all objects do not have enough place in Address bar.

source: Кнопка-переключатель в состоянии фильтра предоставляет в окне выбора только те поля, которые еще не связаны с какими-либо элементами, а в простом состоянии предоставляет к выбору все поля.
en: Switch button in the state of filter displays in the selection window only the fields that are not linked to any items yet, and in the common state it displays all fields for selection.

source: Кнопками %kbd Left %, %kbd Right %, если поля в колонках.
en: using %kbd Left %, %kbd Right % buttons if fields are in columns.

source: Кнопками %kbd Up %, %kbd Down %, если поля в строках.
en: using %kbd Up %, %kbd Down % buttons if fields are in rows.

source: Кнопкой Загрузить из XSD... Загрузить из XSD... можно выбрать файл формата *.xsd, из которого будет загружена выходная структура узлов (также кнопка дублируется командой контекстного меню).
en: Load from XSD... Load from XSD... button enables to select *.xsd file from which the output node structure will be loaded (the button is also duplicated by the context menu command).

source: Кнопкой Переместить в Переменные;
en: Using Move to Variables button.

source: Код вывода сообщений в консоль:
en: Code of outputting messages to the console:

source: Код завершения — содержит значения кодов извлечения для каждого документа.
en: The exit code contains the values of extraction codes for each document.

source: Код клиента
en: Client code

source: Код обработчика является корневым модулем системы ES6.
en: The handler code is a root module of ES6 system.

source: Кодировка файла — UTF-8.
en: File encoding: UTF-8.

source: Кол-во SMS
en: SMS number

source: Кол-во минут вх
en: Number of incoming minutes

source: Количественная оценка разницы между двумя распределениями вероятностей
en: Quantitative evaluation of difference between two distributions of probabilities

source: Количество (см.
en: Count (refer to

source: Количество - аргумент целого типа.
en: Number - argument of the integer type.

source: Количество входов и выходов узла варьируется в зависимости от функционала.
en: Number of the node inputs and outputs varies according to functionality.

source: Количество групп будет равно количеству уникальных идентификаторов.
en: The row count will be equal to the count of the unique identifiers.

source: Количество записей в группе соответствует числу конечных классов исходного столбца.
en: The number of the group records meets the number of the coarse classes of the source column.

source: Количество интервалов — количество интервалов предварительного квантования.
en: Bin count: the prequanting bin count.

source: Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество дней раньше указанной даты.
en: The number can also be negative. In this case, the function will return the date to the given number of days before the specified date.

source: Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество кварталов раньше указанной даты.
en: The number can also be negative. In this case, the function will return the date to the given number of quarters before the specified date.

source: Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество лет раньше указанной даты.
en: The number can also be negative. In this case, the function will return the date to the given number of years before the specified date.

source: Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество месяцев раньше указанной даты.
en: The number can also be negative. In this case, the function will return the date to the given number of months before the specified date.

source: Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество недель раньше указанной даты.
en: The number can also be negative. In this case, the function will return the date to the given number of weeks before the specified date.

source: Количество нейронов в каждом из скрытых слоев;
en: Number of neurons in each hidden layer.

source: Количество нейронов в первом скрытом слое — целое число >= 1 (по умолчанию = 10).
en: Number of neurons in the first hidden layer — integer >= 1 (by default = 10).

source: Количество нейронов в первом скрытом слое — целое число >= 1 (по умолчанию = 10);
en: Number of neurons in the first hidden layer — integer >= 1 (by default = 10).

source: Количество нейронов во втором скрытом слое — целое число >= 1 (по умолчанию = 10).
en: Number of neurons in the second hidden layer — integer >= 1 (by default = 10).

source: Количество отображаемых полей можно изменить с помощью дополнительной функции Столбцы.
en: The number of the displayed fields can be changed using the additional Columns function.

source: Количество отсчетов не может быть больше, чем количество строк в исходной таблице.
en: The lag count cannot exceed the row count in the source table.

source: Количество продаж
en: Volume of sales

source: Количество рестартов - число попыток обучения нейросети (на одном и том же наборе), выполняемых из случайных начальных значений весов нейросети.
en: Number of restarts: number of attempts of the neural network training (using one and the same set) based on the random initial values of the neural network weights.

source: Количество рестартов — число попыток обучения Нейросети (на одном и том же наборе), выполняемых из случайных начальных значений весов сети.
en: Number of restarts: number of attempts of the Neural Network training (using one and the same set) based on the random initial values of the network weights.

source: Количество скрытых слоев (0, 1 или 2);
en: Number of hidden layers (0, 1 or 2).

source: Количество скрытых слоев — предоставляется выбор из списка:
en: Number of hidden layers is selected from the list:

source: Количество уровней вложенности при этом не ограничено.
en: In this case, the number of the nesting levels is not limited.

source: Количество — выбирается количество интервалов, а ширина рассчитывается автоматически, как отношение разности верхней и нижней границ к заданному количеству интервалов.
en: Count: count of bins is selected and the width is automatically calculated as ratio of upper and lower bounds difference and the set count of bins.

source: Количество\_повторов - целое выражение
en: Count\_of\_repeats - integer.

source: Количество\_пробелов - целое выражение.
en: Count\_of\_spaces - integer.

source: Колонки
en: Columns

source: Колонки данных
en: Data Columns

source: Колонки легенды
en: Legend Columns

source: Команда доступна после активации порта.
en: The command is available after the port activation.

source: Команда доступна только для настройки выходного порта.
en: The command is available only for the output port configuration

source: Команда, с помощью которой запускается на выполнение сам узел или содержащий его узел Подмодели (Цикла).
en: The command that enables to launch the node execution or the Supernode (Loop) node that contains it.

source: Командой контекстного меню Добавить дочерний узел Добавить дочерний узел.
en: Use the context menu command: Add child node Add child node.

source: Команды контекстного меню позволяют одновременно развернуть/свернуть все узлы в дереве свойств.
en: The context menu commands enable to collapse/expand all nodes in the properties tree simultaneously.

source: Команды списка:
en: Listed commands:

source: Комментарии
en: Comments

source: Компактный вариант кода вычисления суммы полей калькулятора:
en: Compact code variant for calculation of the calcualtor fields sum:

source: Компонент Выполнение узла не может повторно использовать компоненты Цикл и Узел-ссылка.
en: The Node execution component cannot repeatedly use the Loop and Reference node components.

source: Компонент выполняет действие обратное агрегации по сумме, применяемой в Группировке.
en: The component performs the action inverse to aggregation by sum used in Grouping.

source: Компонент используется в точке разветвления сценария в качестве переключателя между вариантами обработки данных.
en: The component is used in the workflow branch point as a switch between data processing options.

source: Компонент может применяться для циклического исполнения выбранного пользователем узла.
en: The component will be used for the loop execution of the node selected by a user.

source: Компонент позволяет взаимодействовать с внешним REST-сервисом, отправляя ему GET или POST запросы и получая ответы.
en: The component enables to interact with the external REST service. It sends GET or POST requests to it and receives responses.

source: Компонент позволяет взаимодействовать с внешним SOAP-сервисом, отправляя ему запросы и получая ответы.
en: The component enables to interact with the external SOAP service. It sends requests to it and receives responses.

source: Компонент позволяет повторно использовать уже имеющийся узел сценария для обработки новых данных.
en: The component enables to use already existing workflow node for repeated processing of the new data.

source: Компонент предназначен для импорта из базы данных 1С.
en: The component is designated for import from 1C database.

source: Компонент предназначен для импорта набора данных из СУБД.
en: The component is designated for data set import from DBMS.

source: Компонент предназначен для импорта набора данных из Хранилища данных Deductor Warehouse (далее — Хранилище данных).
en: The component is designated for data import from the Data Warehouse Deductor Warehouse (hereafter referred to as the Data Warehouse).

source: Компонент предназначен для импорта таблиц данных из файлов формата XML.
en: The component is designated for data tables import from the XML files.

source: Компонент предназначен для преобразования таблицы в XML.
en: The component is designated for the table transformation to XML.

source: Компонент предназначен для экспорта таблиц данных в файлы формата XML.
en: The component is designated for the data tables export to the XML files.

source: Компонент функционирует в виде приложения для Internet Information Services (IIS) и предоставляет возможность публиковать собственные веб-сервисы.
en: The component is operated in the application form for Internet Information Services (IIS) and gives an opportunity to publish own web services.

source: Компоненты Loginom, специально предназначенные для работы с наборами переменных:
en: The Loginom components specially designated for operations with sets of variables are listed below:

source: Компоненты группы предназначены для оптимизации сценариев путем создания подмоделей и повторного использования узлов, а также формирования логики выполнения сценариев при помощи условий и циклов.
en: The group components are designated for the workflows optimization by supernodes creation, repeated use of nodes and development of the workflow execution logics using antecedents and loops.

source: Компоненты — стандартная библиотека базовых компонентов Loginom;
en: Components are represented by a standard library of the Loginom base components.

source: Конец — дата и время окончания процесса.
en: Finish - date and time of the process finish.

source: Конечные классы отображаются в виде таблицы или диаграммы WoE (см.
en: The coarse classes are displayed in the form of a table or WoE chart (refer to

source: Константное;
en: Constant

source: Конструкция %CONDITION% в тексте запроса будет заменена на строковое значение переменной CONDITION.
en: %CONDITION% construction in the request text will be replaced with the string value of CONDITION variable.

source: Контекстное меню Инспектора свойств содержит команды:
en: The Property inspector context menu contains the following commands:

source: Контекстное меню дублирует общие функции:
en: The context menu duplicates the general functions:

source: Контекстное меню содержит команды:
en: The context menu contains the following commands:

source: Контекстное меню, вызываемое кликом правой клавиши мыши, в основном повторяет перечисленный выше набор:
en: The context menu called by the right mouse button click, for the most part, enables to repeat the set listed above:

source: Контекстное меню:
en: The context menu:

source: Контекстом, в котором запускается на исполнение узел Сценария.
en: By the context within which the Workflow node execution is launched.

source: Контраст 1
en: Contrast 1

source: Контраст 2
en: Contrast 2

source: Контраст 3
en: Contrast 3

source: Контроль диапазона значений
en: Range Control

source: Контроль диапазона значений отвечает за то, чтобы при выполнении узла значение не вышло за указанный диапазон, сохраненный при обучении.
en: Control of values range does not let the value go out of the specified range saved while training when executing the node.

source: Корень дерева в Инспекторе свойств содержит название компонента, на основе которого создан узел сценария, а в колонке Значение выводится метка узла.
en: The tree root in the Property inspector contains the component name used as a basis for the workflow node creation. The node caption is displayed in the Value column.

source: Корневой узел всегда один.
en: There is always only one root node.

source: Корневой узел всегда является контейнером.
en: The root node is always a container.

source: Корневой узел дерева свойств всегда находится в раскрытом состоянии, его нельзя свернуть.
en: The root tree node is always expanded. It is not possible to collapse it.

source: Корректировка Сценария осуществляется путем стандартных манипуляций с узлами (настройки, добавления, удаления), а также воздействиями на их последовательные связи.
en: The Workflow is corrected by the standard operations with nodes (configuration, adding, deletion) and impact on their sequential links.

source: Корреляция продаж товара "Кофе" с товаром "Спагетти" является отрицательной, но при этом абсолютное значение корреляции невелико, и, следовательно, можно говорить об отсутствии взаимосвязи между продажами этих товаров.
en: The sale correlation of the "Coffee" item of goods with the "Spaghetti" item of goods is negative but the absolute correlation value is small, consequently, it is possible to draw a conclusion that there is no interrelation between sales of these items of goods.

source: Кофе
en: Coffee

source: Коэфф.
en: Pearson

source: Коэффициент
en: Coefficient

source: Коэффициент детерминации (R2)
en: Determination coefficient (R2)

source: Коэффициенты
en: Coefficients

source: Коэффициенты регрессии могут быть представлены в виде Таблицы (см.
en: Regression coefficients can be represented in the Table form (refer to

source: Кресло плетеное
en: Rattan chair

source: Критерии останова
en: Stop Criteria

source: Критерии останова автоподбора
en: Auto Stop Criteria

source: Критерий значимости факторов:
en: Criterion of factors significance:
